Tekla.Structures.Analysis.AnalysisLoadGroup
The AnalysisLoadGroup class contains information related to analysis load groups.

Tekla.Structures.Analysis.AnalysisLoadGroup._LoadGroupID
The identifier of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup._Compatible
This indicates whether the load group is compatible.

Tekla.Structures.Analysis.AnalysisLoadGroup._Direction
The direction of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup._Incompatible
This indicates whether the load group is incompatible.

Tekla.Structures.Analysis.AnalysisLoadGroup._Name
The name of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup._Type
The type of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupID
The identifier of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.Compatible
Indicates whether the load group is compatible.

Tekla.Structures.Analysis.AnalysisLoadGroup.Direction
The direction of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.Incompatible
Indicates whether the load group is incompatible.

Tekla.Structures.Analysis.AnalysisLoadGroup.Name
The name of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.Type
The type of the load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.Select
Selects an AnalysisLoadGroup.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisLoadGroup.SelectInstance
DO NOT USE! For internal usage only!